/*企业发放的奖金根据利润提成。

利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成。
从键盘输入当月利润I，求应发放奖金总数？*/
#include <stdio.h>
int main()
{
    double profit, sum;
    printf("请输入当月利润：");
    scanf("%lf", &profit);
    if (profit <= 100000)
        sum = profit * 1.1;
    if (profit > 100000 && profit <= 200000)
        sum = 110000.0 + (profit - 100000) * 1.075;
    if (profit > 200000 && profit <= 400000)
        sum = 110000.0 + 107500 + (profit - 200000) * 1.05;
    if (profit > 400000 && profit <= 600000)
        sum = 110000.0 + 107500 + 210000 + (profit - 400000) * 1.03;
    if (profit > 600000 && profit <= 1000000)
        sum = 110000.0 + 107500 + 210000 + 206000 + (profit - 600000) * 1.015;
    if (profit > 1000000)
        sum = 110000.0 + 107500 + 210000 + 206000 + 406000 + (profit - 1000000) * 1.01;
    printf("你的总奖金为：%lf\n", sum);
    printf("你的提成为：%lf", sum - profit);
}